<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Python Data Cleaning: Basics II

## 1.0 Importing our Libraries

In [1]:
# Importing the Pandas Library
#
import pandas as pd

# Importing the Numpy Library
#
import numpy as np

## 1.1 Validity

In [ ]:
# Example 1: Irrelevant Data
# Irrelevant data are those that are not actually needed, and don’t fit under 
# the context of the problem we’re trying to solve. 
# For example, we will drop the Team and Weight columns from the dataset below
# since we will not need them in our analysis
# 
 
# Making the dataframe from csv file 
data_df = pd.read_csv("http://bit.ly/MSDS-NBADataset", index_col ="Name" ) 


# Dropping the irrelevant columns i.e. Team and Weight
# Those values were dropped since axis was set equal to 1 and 
# the changes were made in the original data frame since inplace was True.
data_df.drop(["Team", "Weight"], axis = 1, inplace = True) 
  
# Display the resulting dataframe
data_df

               Number Position   Age Height            College     Salary
Name
Avery Bradley     0.0       PG  25.0    6-2              Texas  7730337.0
Jae Crowder      99.0       SF  25.0    6-6          Marquette  6796117.0
John Holland     30.0       SG  27.0    6-5  Boston University        NaN
R.J. Hunter      28.0       SG  22.0    6-5      Georgia State  1148640.0
Jonas Jerebko     8.0       PF  29.0   6-10                NaN  5000000.0
...               ...      ...   ...    ...                ...        ...
Shelvin Mack      8.0       PG  26.0    6-3             Butler  2433333.0
Raul Neto        25.0       PG  24.0    6-1                NaN   900000.0
Tibor Pleiss     21.0        C  26.0    7-3                NaN  2900000.0
Jeff Withey      24.0        C  26.0    7-0             Kansas   947276.0
NaN               NaN      NaN   NaN    NaN                NaN        NaN

[458 rows x 6 columns]

In [ ]:
# Example 2: Syntax Errors
# We can also remove any syntax error than we find in our records.
# Remove white spaces: Extra white spaces at the beginning or the end of a string should be removed. 
# Pad strings: Strings can be padded with spaces or other characters to a certain width i.e. 313 => 000313 (6 digits). 
# Let's remove use the str.strip function on the respective column name to strip the leading and trailing space 
# 

# Creating the DataFrame to be used
df1 = {
    'County':['     Nairobi     ', ' Machakos       ', ' Kisumu', 'Nakuru       ', 'Naroko '],
   'Score':[73, 83, 75, 84, 61]}
 
df1 = pd.DataFrame(df1,columns=['County','Score'])

# Displaying the resulting dataframe
df1['County']

0         Nairobi
1      Machakos
2               Kisumu
3        Nakuru
4              Naroko
Name: County, dtype: object

In [ ]:
# Example 2: Syntax Errors
# We can use the str.strip function on the respective column name to strip the leading and trailing spaces  
# 

df1['County'] = df1['County'].str.strip()


# Displaying the resulting dataframe
df1['County']

0     Nairobi
1    Machakos
2      Kisumu
3      Nakuru
4      Naroko
Name: County, dtype: object

In [ ]:
# Example 3: Syntax Errors
# We can also use str.replace() function on the respective column to strip all the spaces 
# 

df1['County'] = df1['County'].str.replace(" ","")

# Displaying the resulting dataframe
df1

     County  Score
0   Nairobi     73
1  Machakos     83
2    Kisumu     75
3    Nakuru     84
4    Naroko     61

In [ ]:
# Example 4: 
# Fix typos: Strings can be entered in many different ways, and no wonder they can have mistakes.
#

# If you want to replace certain words - "Naroko" with "Narok"
df1['County'] = df1['County'].str.replace('Naroko', 'Narok')

df1

### <font color="green">1.1 Challenges</font>

In [ ]:
# Challenge 1
# We have been given the following dataset to work with
# url = http://bit.ly/MSOriginOfRefugees
# and we will be answering the following question;
# Which territories of origin had the highest no. of refugees from the year 2005 - 2010?
# Provide the relevant data for your analysis below. 
# NB: We are only expected to clean our data. Once finished compare answers with other classmates. 
#
df = pd.read_csv('http://bit.ly/MSOriginOfRefugees')

df['Country Name'] = df['Country Name'].str.strip()
df

     Country Name Country Code  Year    Value
0      Arab World          ARB  1990  2212498
1      Arab World          ARB  1991  2408680
2      Arab World          ARB  1992  2614885
3      Arab World          ARB  1993  1906599
4      Arab World          ARB  1994  2001784
...           ...          ...   ...      ...
6003     Zimbabwe          ZWE  2012    22101
6004     Zimbabwe          ZWE  2013    19734
6005     Zimbabwe          ZWE  2014    22492
6006     Zimbabwe          ZWE  2015    21344
6007     Zimbabwe          ZWE  2016    18116

[6008 rows x 4 columns]

In [ ]:
# Challenge 2
# Use the lstrip() function of .str method to check the variables with the leading and trailing spaces.
# of the given NBA dataset below. 
# Later, strip those leading and trailing spaces in the identified variables.
# url = http://bit.ly/MSDS-NBADataset
# 
NBA = pd.read_csv('nba (2).csv')
NBA['Name'].str.lstrip()
NBA['College'].str.lstrip()
NBA['Team'].str.lstrip()


NBA['Name'] = NBA['Name'].str.strip()
NBA['College'] = NBA['College'].str.strip()
NBA['Team'] = NBA['Team'].str.strip()
NBA

In [ ]:
# Challenge 3
# Remove the text [edit] at the end of the university towns use sing the replace() function of the .str method
# Use the following dataset; url = http://bit.ly/MSUniversityTown
#
df = pd.read_csv('http://bit.ly/MSUniversityTown', delimiter=';')
df['Alabama[edit]'] = df['Alabama[edit]'].str.replace('[edit]', '')
df
# df1['County'] = df1['County'].str.replace(" ","")

## 1.2 Accuracy

### <font color="green">1.2 Challenge</font>

In [ ]:
# Challenge 1: In-record & cross-datasets errors
# These errors result from having two or more values in the same row or across 
# datasets that contradict with each other. 
# For example, if we have a dataset about the cost of living in cities. 
# The total column must be equivalent to the sum of rent, transport, and food. 
# Similarly, a child can’t be married. An employee’s salary can’t be less than the calculated taxes etc.
# Using the given dataset below, determine and fix errors where the total population is not a sum of
# total male population and total female population 
# dataset url = http://bit.ly/MSPopulationDistribution
# Hint: Review Pandas Basics 
# 
df = pd.read_csv('http://bit.ly/MSPopulationDistribution')


df["New_total"] = df["Total_Male_Population"] + df["Total_Female_Population"]

df

import numpy as np
df['Diff'] = np.where( df['Total_Population'] == df['New_total'] , 1, 0)

df.loc[df['Diff'] == 0]

Empty DataFrame
Columns: [Urban_Center, District, Status, Core-Urban_Male_Population, Core-Urban_Female_Population, Total_Core-Urban_Population, Peri-Urban_Male_Population, Peri-Urban_Female_Population, Total_Peri-Urban_Population, Rural_Male_Population, Rural_Female_Population, Total_Rural_Population, Total_Male_Population, Total_Female_Population, Total_Population, OBJECTID, New_total, Diff]
Index: []

## 1.3 Completeness

In [ ]:
# Example 1: Checking/ Counting Missing Values 
# 

# Creating a dataframe to work with
df1 = {
    'Subject':['Humanities', 'Physical Education', 'Home Science', 'Mathematics', 'Physics',
               'Chemistry','Arts'],
   'Score':[62, 47, np.nan, 74, np.nan, 77, 85]}
 
df1 = pd.DataFrame(df1,columns=['Subject','Score'])

print(df1)

# Checking if there is any missing value in dataframe as a whole
# Uncomment the following line after running the previous lines
df1.isnull()

# Checking if there is any missing value across each column
# Uncomment the following line after running the previous lines
# df1.isnull().any()

# Checking how many missing values there are across each column
# Uncomment the following line after running the previous lines
df1.isnull().sum()

# Or we can do a quick check to see if we have any missing values at all
# Uncomment the following line after running the previous lines
print(df1.isnull().values.any())

# We might also want to get a total count of missing values
# Uncomment the following line after running the previous lines
print(df1.isnull().values.any().sum())

              Subject  Score
0          Humanities   62.0
1  Physical Education   47.0
2        Home Science    NaN
3         Mathematics   74.0
4             Physics    NaN
5           Chemistry   77.0
6                Arts   85.0
True
1

In [ ]:
# Example 2: Dropping Missing Values 
# If there are only a few null values and you know that deleting values 
# will not cause adverse effects on your result, 
# remove them from your DataFrame and store that in a new DataFrame

# Droppping all 
# Uncomment the following 2 lines after running the previous lines
clean_df = df1.dropna()
print(clean_df)

# Verifying that you no longer have any null values by running 
# Uncomment the following line after running the previous lines
print(clean_df.isnull().sum())

              Subject  Score
0          Humanities   62.0
1  Physical Education   47.0
3         Mathematics   74.0
5           Chemistry   77.0
6                Arts   85.0
Subject    0
Score      0
dtype: int64

In [ ]:
# Exmaple 2: Dropping instances/records/rows with NA missing values 
# 

# Dropping all rows with any NA values 
all_rows_any_na = df1.dropna()
print(all_rows_any_na)

# Dropping all rows that have all NA values
# Uncomment the 2 lines below after running the previous lines
all_rows_all_na = df1.dropna(how="all")
print(all_rows_all_na)

# We can also put a limitation on how many non-null values need to be in a row 
# we can retain the data that has at least 2 non-null values as shown below
# Uncomment the 2 lines below after running the previous lines
df1_thresh = df1.dropna(thresh=2)
print(df1_thresh)

              Subject  Score
0          Humanities   62.0
1  Physical Education   47.0
3         Mathematics   74.0
5           Chemistry   77.0
6                Arts   85.0
              Subject  Score
0          Humanities   62.0
1  Physical Education   47.0
2        Home Science    NaN
3         Mathematics   74.0
4             Physics    NaN
5           Chemistry   77.0
6                Arts   85.0
              Subject  Score
0          Humanities   62.0
1  Physical Education   47.0
3         Mathematics   74.0
5           Chemistry   77.0
6                Arts   85.0

In [ ]:
# Example 2: Missing Values
# Dropping attributes (variables/columns)
# We can apply the same kind of criteria to our columns. 
# We just need to use the parameter axis=1 in our code. 
# That means to operate on columns, not rows. 
# (We could have used axis=0 in our row examples, 
# but it is 0 by default if you don’t enter anything.)
# 

# Dropping all attributes with any NA values
# 
all_cols_any_na = df1.dropna(axis=1)
print(all_cols_any_na)

# Dropping all attributes that have all NA values
# Uncomment the 2 lines below

all_cols_all_na = df1.dropna(axis=1, how="all")
print(all_cols_all_na)

# We can also put a limitation on how many non-null values need to be in a attributes 
# we can retain the data that has at least 2 non-null values as shown below
# Uncomment the 2 lines below
df1_thresh = df1.dropna(thresh=2)
print(df1_thresh)

              Subject
0          Humanities
1  Physical Education
2        Home Science
3         Mathematics
4             Physics
5           Chemistry
6                Arts
              Subject  Score
0          Humanities   62.0
1  Physical Education   47.0
2        Home Science    NaN
3         Mathematics   74.0
4             Physics    NaN
5           Chemistry   77.0
6                Arts   85.0
              Subject  Score
0          Humanities   62.0
1  Physical Education   47.0
3         Mathematics   74.0
5           Chemistry   77.0
6                Arts   85.0

In [ ]:
# Example 3: Missing Values
# Imputing the attribute mean for all missing values
# Mean imputation replaces missing values with the mean value of that feature/variable. 
# Mean imputation is one of the most ‘naive’ imputation methods 
# because unlike more complex methods like k-nearest neighbors imputation, 
# it does not use the information we have about an observation to estimate a value for it.

# Creating a dataframe to work with
subjects_df_mean = {
    'Subject':['Humanities', 'Physical Education', 'Home Science', 'Mathematics', 'Physics',
               'Chemistry','Arts'],
   'Score':[62, 47, np.nan, 74, np.nan, 77, 85]}
subjects_df_mean = pd.DataFrame(subjects_df_mean,columns=['Subject','Score'])

# printing our dataframe
print(subjects_df_mean)

# imputing the mean 
subjects_df_mean['Score'] = subjects_df_mean['Score'].fillna((subjects_df_mean['Score'].mean()))

# printing out our updated dataframe
print(subjects_df_mean)

              Subject  Score
0          Humanities   62.0
1  Physical Education   47.0
2        Home Science    NaN
3         Mathematics   74.0
4             Physics    NaN
5           Chemistry   77.0
6                Arts   85.0
              Subject  Score
0          Humanities   62.0
1  Physical Education   47.0
2        Home Science   69.0
3         Mathematics   74.0
4             Physics   69.0
5           Chemistry   77.0
6                Arts   85.0

In [ ]:
# Example 4: Missing Values
# Imputing the attribute median for all missing values
# 

# Creating a dataframe to work with
subjects_df_median = {
    'Subject':['Humanities', 'Physical Education', 'Home Science', 'Mathematics', 'Physics',
               'Chemistry','Arts'],
   'Score':[62, 47, np.nan, 74, np.nan, 77, 85]}
subjects_df_median = pd.DataFrame(subjects_df_median,columns=['Subject','Score'])

# printing our dataframe
print(subjects_df_median)

# imputing the median 
subjects_df_median['Score'] = subjects_df_median['Score'].fillna((subjects_df_median['Score'].median()))

# printing out our updated dataframe
print(subjects_df_median)

              Subject  Score
0          Humanities   62.0
1  Physical Education   47.0
2        Home Science    NaN
3         Mathematics   74.0
4             Physics    NaN
5           Chemistry   77.0
6                Arts   85.0
              Subject  Score
0          Humanities   62.0
1  Physical Education   47.0
2        Home Science   74.0
3         Mathematics   74.0
4             Physics   74.0
5           Chemistry   77.0
6                Arts   85.0

In [ ]:
# Example 5: Missing Values 
# Imputing the attribute mode for all missing values
# 
# Creating a dataframe to work with
subjects_df_mode = {
    'Subject':['Humanities', 'Physical Education', 'Home Science', 'Mathematics', 'Physics',
               'Chemistry','Arts'],
   'Score':[62, 47, np.nan, 74, np.nan, 77, 85]}
subjects_df_mode = pd.DataFrame(subjects_df_mode,columns=['Subject','Score'])

# printing our dataframe
print(subjects_df_mode)

# imputing the mode 
subjects_df_mode['Score'] = subjects_df_mode['Score'].fillna((subjects_df_mode['Score'].mode()))

# printing out our updated dataframe
print(subjects_df_mode)

              Subject  Score
0          Humanities   62.0
1  Physical Education   47.0
2        Home Science    NaN
3         Mathematics   74.0
4             Physics    NaN
5           Chemistry   77.0
6                Arts   85.0
              Subject  Score
0          Humanities   62.0
1  Physical Education   47.0
2        Home Science   74.0
3         Mathematics   74.0
4             Physics   85.0
5           Chemistry   77.0
6                Arts   85.0

In [ ]:
# Example 6: Missing Values 
# Or maybe we just want to fill in missing values with a single value as shown below
# 

df1 = {
    'Subject':['Humanities', 'Physical Education', 'Home Science', 'Mathematics', 'Physics',
               'Chemistry','Arts'],
   'Score':[62, 47, np.nan, 74, np.nan, 77, 85]}
 
df1 = pd.DataFrame(df1,columns=['Subject','Score'])

# Replace missing values with a number
df1['Score'].fillna(60, inplace=True)

print(df1)

              Subject  Score
0          Humanities   62.0
1  Physical Education   47.0
2        Home Science   60.0
3         Mathematics   74.0
4             Physics   60.0
5           Chemistry   77.0
6                Arts   85.0

In [ ]:
# Example 7: Missing Values
# Using the following property dataset, we will make a list of missing value types
# then load our dataset below
# 

# reading our dataset
property_dataset = pd.read_csv("http://bit.ly/MS-PropertyDataset")
property_dataset

# Now making a list of missing value types found in our dataset
# Uncommenting the 3 lines below after running the previous lines
missing_values = ["n/a", "na", "--"]
property_dataset = pd.read_csv("http://bit.ly/MS-PropertyDataset", na_values = missing_values)
property_dataset

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

### <font color="green">1.3 Challenges</font>

In [ ]:
# Challenge 1
# Clean the following dataset that contains missing values
# url = http://bit.ly/DSRussianInvestigation
# 

nuln =["NaT", "n/a", "na", "--"]
df = pd.read_csv('http://bit.ly/DSRussianInvestigation', na_values=nuln)

df['investigation-start'] = pd.to_datetime(df['investigation-start'])
df['investigation-end'] = pd.to_datetime(df['investigation-end'])
df['investigation-days'] = pd.to_timedelta(df['investigation-days'])

df['investigation-end'] = df['investigation-end'].fillna(df['investigation-start'] + df['investigation-days'])

df['name'] = df['name'].fillna('Unkown')
df['indictment-days '] = df['indictment-days '].fillna(method='ffill')
df['type'] = df['type'].fillna(method='ffill')
df

    investigation investigation-start  ... american      president
0       watergate          1973-05-19  ...     True  Richard Nixon
1       watergate          1973-05-19  ...     True  Richard Nixon
2       watergate          1973-05-19  ...     True  Richard Nixon
3       watergate          1973-05-19  ...     True  Richard Nixon
4       watergate          1973-05-19  ...     True  Richard Nixon
..            ...                 ...  ...      ...            ...
189        russia          2017-05-17  ...    False   Donald Trump
190        russia          2017-05-17  ...    False   Donald Trump
191        russia          2017-05-17  ...    False   Donald Trump
192        russia          2017-05-17  ...     True   Donald Trump
193        russia          2017-05-17  ...     True   Donald Trump

[194 rows x 13 columns]

In [2]:
# Challenge 2
# Examine and clean the avengers dataset
# http://bit.ly/MSAvengers
# 
avengers = pd.read_csv('http://bit.ly/MSAvengers', encoding="ISO8859")

avengers.isnull().sum()
avengers.drop(columns=['Probationary Introl', 'Death1','Return1', 'Death2','Return2', 'Death3', 'Return3', 'Death4', 'Return4', 'Death5', 'Return5', 'Notes'], inplace=True)

avengers.isnull().sum()
avengers['Name/Alias'].fillna('Unkown', inplace=True)

avengers.isnull().sum()
avengers['Full/Reserve Avengers Intro'].fillna(method='ffill', inplace = True)

avengers.isnull().sum()

URL                            0
Name/Alias                     0
Appearances                    0
Current?                       0
Gender                         0
Full/Reserve Avengers Intro    0
Year                           0
Years since joining            0
Honorary                       0
dtype: int64

In [7]:
# Challenge 3
# Clean the dataset where 16 multiple choice ability items were taken from the Synthetic Aperture Personality Assessment (SAPA)
# web based personality assessment project. The data from 1525 subjects are included as a demonstration 
# set for scoring multiple choice inventories and doing basic item statistics.
# dataset url = http://bit.ly/MSIQQuestions
#

#Dataset not available

In [14]:
# Challenge 4
# The dataset below contains data from an experiment conducted by the Department of Biology 
# at Kenyon College at a site near the campus in Gambier, Ohio. A student and faculty volunteers 
# planted 1000 white pine (Pinus strobes) seedlings at the Brown Family Environmental Center. 
# These seedlings were planted in two grids, distinguished by 10- and 15-foot spacings between the seedlings. 
# Several variables were measured and recorded for each seedling over time (in 1990, 1996, and 1997).
# Handle the missing values of this dataset; dataset url = http://bit.ly/MSPines
# 
# Features Description
# Row	Row number in pine plantation
# Col	Column number in pine plantation
# Hgt90	Tree height at time of planting (cm)
# Hgt96	Tree height in September 1996 (cm)
# Diam96	Tree trunk diameter in September 1996 (cm)
# Grow96	Leader growth during 1996 (cm)
# Hgt97	Tree height in September 1997 (cm)
# Diam97	Tree trunk diameter in September 1997 (cm)
# Spread97	Widest lateral spread in September 1997 (cm)
# Needles97	Needle length in September 1997 (mm)
# Deer95	Type of deer damage in September 1995: 0 = none, 1 = browsed
# Deer97	Type of deer damage in September 1997: 0 = none, 1 = browsed
# Cover95	Thorny cover in September 1995: 0 = none; 1 = some; 2 = moderate; 3 = lots
# Fert	Indicator for fertilizer: 0 = no, 1 = yes
# Spacing	Distance (in feet) between trees (10 or 15)
#

df = pd.read_csv('http://bit.ly/MSPines')
df.dropna(inplace=True)
df

#Drop all null values

,Unnamed: 0,Row,Col,Hgt90,Hgt96,Diam96,Grow96,Hgt97,Diam97,Spread.97,Needles97,Deer95,Deer97,Cover95,Fert,Spacing
1,2,1,2,14.0,284.0,4.2,96.0,362.0,6.6,162.0,66.0,0.0,1.0,2,0,15
2,3,1,3,17.0,387.0,7.4,110.0,442.0,9.3,250.0,77.0,0.0,0.0,1,0,15
4,5,1,5,24.0,294.0,3.9,70.0,369.0,7.0,176.0,72.0,0.0,0.0,2,0,15
5,6,1,6,22.0,310.0,5.6,84.0,365.0,6.9,215.0,76.0,0.0,0.0,1,0,15
6,7,1,7,18.0,318.0,5.4,96.0,356.0,7.6,238.0,74.5,0.0,0.0,0,0,15
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
994,995,44,22,21.0,213.0,2.3,71.0,287.0,3.7,116.0,65.0,0.0,1.0,0,0,10
995,996,44,23,17.0,346.0,4.6,100.0,448.0,6.4,229.0,85.0,1.0,1.0,1,0,10
996,997,44,24,20.0,315.0,4.3,81.0,388.0,7.0,206.0,63.0,1.0,1.0,1,0,10
997,998,44,25,11.0,319.0,4.2,91.0,381.0,7.2,241.0,63.0,1.0,1.0,0,0,10
998,999,44,26,19.0,231.0,2.4,76.0,263.0,4.9,127.0,63.0,1.0,1.0,0,0,10

In [21]:
# Challenge 5
# Some geologists were interested in the water chemistry of rivers in Coastal New York. 
# They took water samples at three different locations in four rivers. 
# The sampling sites were chosen to investigate how the composition of the water changes 
# as it flows from the source to the mouth of each river. 
# The sampling sites were labeled as upstream, midstream, and downstream. 
# This dataset contains the concentrations (parts per million) of a variety of elements in those water samples. 
# The dataset RiverIron contains the information for iron (FE) alone, along with the log of the concentration.
# Handle the missing values found in this dataset; dataset url = http://bit.ly/MSRiverSamples

# Features Description
# River	One of four rivers: Grasse, Oswegatchie, Raquette, or St. Regis
# Site	Location: 1=UpStream, 2=MidStream, 3=Downstream
# Al	Aluminum
# Ba	Barium
# Br	Bromine
# Ca	Calcium
# Ce	Cerium
# Cu	Copper
# Dy	Dysprosium
# Er	Erbim
# Fe	Iron
# Gd	Gadolinium
# Ho	Holmum
# K	Potassium
# La	Lathanum
# Li	Lithium
# Mg	Magnesium
# Mn	Manganese
# Nd	Neodymium
# Pr	Proseyodymium
# Rb	Rubidium
# Si	Silicon
# Sr	Strontium
# Y	Yttrium
# Yb	Ytterbium
# Zn	Zinc
# Zr	Zirconium
#


df = pd.read_csv('http://bit.ly/MSRiverSamples')
df['Ho'] = df['Ho'].fillna(df['Ho'].mean())

df.isnull().sum()

Unnamed: 0    0
River         0
Site          0
Al            0
Ba            0
Br            0
Ca            0
Ce            0
Cu            0
Dy            0
Er            0
Fe            0
Gd            0
Ho            0
K             0
La            0
Li            0
Mg            0
Mn            0
Nd            0
Pr            0
Rb            0
Si            0
Sr            0
Y             0
Yb            0
Zn            0
Zr            0
dtype: int64

## 1.4 Consistency

In [ ]:
# Example 1: Duplicates
# Duplicates are data points that are repeated in your dataset. 
# These should be simply removed.
#

raw_data = {'first_name': ['Jamila', 'Jamila', 'Jane','Joma', 'Ulia', 'Dorcas'], 
        'last_name': ['Mohammed', 'Mohammed', 'Milner','Tech', 'Shevchenko', 'Wanjiru'], 
        'age': [52, 52, 43, 77, 25, 19], 
        'pre_assessment': [5, 5, 5, 43, 5, 2],
        'post_assessment': [35, 35, 25, 57, 72, 71]}
df_duplicate = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'pre_assessment', 'post_assessment'])
print(df_duplicate)


# Identifying which observations are duplicates
df_non_duplicates = df.drop_duplicates()

# Let's see these non-duplicate files
print(df_non_duplicates)

### <font color="green">1.4 Challenges</font>

In [ ]:
# Challenge  1
# Identify and handle the duplicted records found in the following dataset
# dataset url = http://bit.ly/MoviesDataset1
#

In [ ]:
# Clean the following dataset 
# dataset url = http://bit.ly/EmployeesDataset
# 
OUR CODE GOES HERE

## 1.5 Uniformity

In [ ]:
# Example 1: Standardization - Renaming column names
# We can rename multiple  data frame column names in the following manner
# 

# Create an example dataframe
#
officials_data = {'Moderator': ['Wanjiku', 'Muthoni', 'Kagure', 'Muema', 'Kariuki'], 
        'Date': ['2015-02-11', '2013-02-22', '2015-02-11', '2014-02-11', '2011-02-11'], 
        'Score': [14, 34, 41, 12, 13]}
officials_data = pd.DataFrame(officials_data)
print(officials_data)

# Renaming the column names
#
officials_data.columns = ['Senior Leader', 'Time', 'Score']
print(officials_data)

  Moderator        Date  Score
0   Wanjiku  2015-02-11     14
1   Muthoni  2013-02-22     34
2    Kagure  2015-02-11     41
3     Muema  2014-02-11     12
4   Kariuki  2011-02-11     13
  Senior Leader        Time  Score
0       Wanjiku  2015-02-11     14
1       Muthoni  2013-02-22     34
2        Kagure  2015-02-11     41
3         Muema  2014-02-11     12
4       Kariuki  2011-02-11     13

In [ ]:
# Example 2: Standardization - Fixing messy column names
# Sometimes you might have column names which are uppercase, with spaces, 
# and whitespace all around. How do we fix this? 
# We use the .str method that we use on text data. 
# Ideally, we chain a bunch of .str functions as shown below; 
# 

# we use strip(), lower() and replace() functions
# 
officials_data.columns = officials_data.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '')
print(officials_data)

In [ ]:
# Example 3: Date Type Conversion
# Make sure numbers are stored as numerical data types. 
# A date should be stored as a date object, or a Unix timestamp (number of seconds), and so on. 
# Making the respecive conversion is advised.
# 

# Let's convert our strings to Datetime data type
# importing datatime module
from datetime import datetime

# Creating our data frame
data = {'date': ['2015-05-01 18:47:05.069722', '2015-05-01 18:47:05.119994', 
                 '2015-05-02 18:47:05.178768', '2015-05-02 18:47:05.230071', 
                 '2015-05-02 18:47:05.230071', '2015-05-02 18:47:05.280592', 
                 '2015-05-03 18:47:05.332662', '2015-05-03 18:47:05.385109', 
                 '2015-05-04 18:47:05.436523', '2015-05-04 18:47:05.486877'], 
        'value': [1, 2, 4, 5, 6, 3, 2, 1, 15, 11]}
df = pd.DataFrame(data, columns = ['date', 'value'])

# printing our dataframe
print(df.info())

# Converting date column from string to datetime
df['date'] = pd.to_datetime(df['date']) 

# printing our updated dataframe
print(df.info())

In [ ]:
# Example 4: Data Type conversion
# Sometimes, especially when we’re reading in a CSV with a bunch of numbers, 
# some of the numbers will read in as strings instead of numeric values, or vice versa. 
# Let's fix the release year to be a string and not a number;
# In pandas, the datatype string appears as object
# 

# First let's see how our datatypes appear while loading the dataset
data = pd.read_csv('http://bit.ly/MovieMetaData')
print(data.info())

# Now let's specify that our 'duration column needs to be an integer value'
# Uncomment the lines below after running the previous lines
# data = pd.read_csv('http://bit.ly/MovieMetaData', dtype={'title_year': str})
# print(data.dtypes)

### <font color="green">1.5 Challenges</font>

In [ ]:
# Challenge 1
# Rename and fix the columns names of the following dataset
# url = http://bit.ly/MSPropertyDataset
# Columns = Street number, Street name, Owner Occupied, No. of Bedrooms
# 
OUR CODE GOES HERE

In [ ]:
# Challenge 2
# Convert the following dataframe column Data from string to datetime format
# 

schedule_df = pd.DataFrame({'Date':['23/9/2011', '11/4/2010', '10/12/2019'], 
                'Event':['Music', 'Drama', 'Arts'], 
                'Cost':[17000, 55000, 25000]}) 

OUR CODE GOES HERE

In [ ]:
# Challenge 3
# Work on converting the following data types from the given sales dataset
# url = http://bit.ly/SalesDataset
# - The Customer Number is a float64 but it should be an int64
# - The 2016 and 2017 columns are stored as objects, not numerical values such as a float64 or int64
# - Percent Growth and Jan Units are also stored as objects not numerical values
# - Month, Day and Year columns that should be converted to datetime64
# - Active column should be a boolean
# We cannot work with this dataset until we clean up normalize the datatypes 
# A good example of this would be if we were to perform the following operation 
#

# Loading our sales dataset
sales_df = pd.read_csv("http://bit.ly/SalesDataset")

# and then perform some operation reveals a problem
sales_df['2016'] + sales_df['2017'] 

# Performing our conversion below
OUR CODE GOES HERE